In [1]:
import numpy as npp
import pandas as pd

Data Load:
Text-based files

Excel files

Database loading

Web/API loading

Big data formats

From clipboard & manual creation

In [ ]:
# CSV file :
"""
Encoding Error in CSV file :
set:
encoding="utf-8"        OR
encoding="latin1"
"""
df_csv = pd.read_csv("DataSets_Diff-Formate/student-dataset.csv")
pd.DataFrame(df_csv.head(2))

,id,name,nationality,city,latitude,longitude,gender,ethnic.group,age,english.grade,math.grade,sciences.grade,language.grade,portfolio.rating,coverletter.rating,refletter.rating
0,0,Kiana Lor,China,Suzhou,31.31,120.62,F,NaN,22,3.5,3.7,3.1,1.0,4,4.0,4
1,1,Joshua Lonaker,United States of America,Santa Clarita,34.39,-118.54,M,NaN,22,2.9,3.2,3.6,5.0,5,4.0,5

In [ ]:
# text File:
df_txt = pd.read_table("DataSets_Diff-Formate/student-dataset.txt", sep=",")
pd.DataFrame(df_txt.head(2))

,id,name,nationality,city,latitude,longitude,gender,ethnic.group,age,english.grade,math.grade,sciences.grade,language.grade,portfolio.rating,coverletter.rating,refletter.rating
0,0,Kiana Lor,China,Suzhou,31.31,120.62,F,NaN,22,3.5,3.7,3.1,1.0,4,4.0,4
1,1,Joshua Lonaker,United States of America,Santa Clarita,34.39,-118.54,M,NaN,22,2.9,3.2,3.6,5.0,5,4.0,5

In [ ]:
# Excel File:
df_xlsx = pd.read_excel("DataSets_Diff-Formate/student-dataset.xlsx")
pd.DataFrame(df_xlsx.head(2))

,id,name,nationality,city,latitude,longitude,gender,ethnic.group,age,english.grade,math.grade,sciences.grade,language.grade,portfolio.rating,coverletter.rating,refletter.rating
0,0,Kiana Lor,China,Suzhou,31.31,120.62,F,NaN,22,3.5,3.7,3.1,1.0,4,4.0,4
1,1,Joshua Lonaker,United States of America,Santa Clarita,34.39,-118.54,M,NaN,22,2.9,3.2,3.6,5.0,5,4.0,5

In [17]:
# Json File:
df_json = pd.read_json("DataSets_Diff-Formate/student-dataset.json")
pd.DataFrame(df_json.head(2))

,id,name,nationality,city,latitude,longitude,gender,ethnic.group,age,english.grade,math.grade,sciences.grade,language.grade,portfolio.rating,coverletter.rating,refletter.rating
0,0,Kiana Lor,China,Suzhou,31.31,120.62,F,NA,22,3.5,3.7,3.1,1.0,4,4.0,4
1,1,Joshua Lonaker,United States of America,Santa Clarita,34.39,-118.54,M,NA,22,2.9,3.2,3.6,5.0,5,4.0,5

In [ ]:
# Needed Columns Load:
df_marks = pd.read_csv("DataSets_Diff-Formate/student-dataset.csv",usecols=["english.grade", "math.grade", "sciences.grade", "language.grade"])
pd.DataFrame(df_marks.head(2))

   english.grade  math.grade  sciences.grade  language.grade
0            3.5         3.7             3.1             1.0
1            2.9         3.2             3.6             5.0

In [ ]:
# Conver NA, ?, " ", 0 to NaN: 
df_NaN = pd.read_csv("DataSets_Diff-Formate/student-dataset.csv", na_values=["NA"])
pd.DataFrame(df_NaN.head(2))

,id,name,nationality,city,latitude,longitude,gender,ethnic.group,age,english.grade,math.grade,sciences.grade,language.grade,portfolio.rating,coverletter.rating,refletter.rating
0,0,Kiana Lor,China,Suzhou,31.31,120.62,F,NaN,22,3.5,3.7,3.1,1.0,4,4.0,4
1,1,Joshua Lonaker,United States of America,Santa Clarita,34.39,-118.54,M,NaN,22,2.9,3.2,3.6,5.0,5,4.0,5

In [21]:
# direct URl:
url = "https://raw.githubusercontent.com/mwaskom/seaborn-data/master/tips.csv"
df_url = pd.read_csv(url)
pd.DataFrame(df_url.head(2))

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3